app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def profile
    @user = User.find(session[:user_id])