app/controllers/users_controller.rb

	def new
		if is_user_logged_in
			@user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def create
  		# render plain: params[:user].inspect
  		if params[:cancel_button]
  			redirect_to(:action => 'index',:controller => 'sessions')
  		else
  			if is_user_logged_in
  				@user = User.find(session[:user_id])
			# TODO
			else
				@user = User.new(user_params)
				if @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "salt", "updated_at", "useraddress", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def index
		@users = User.search(params[:search_query_user])
---
SELECT "users".* FROM "users"  WHERE (username like '%%')